proxy/load-test.yml
config:
  target: 'http://localhost:3000'
  # payload:
  #   path: "./records.csv"
  #   fields: "recordNumber"
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 60
      arrivalRate: 10
    - duration: 60
      arrivalRate: 100
    - duration: 60
      arrivalRate: 1000
scenarios:
  - flow:
    - get:
        url: "/suggested?prod_id={{$randomNumber(900000,9999999)}}"